Ran Plan for 2 projects:

1. dir: `infrastructure/gcp/cloud-deployment/gcompute-engine-bastion` workspace: `default`
1. dir: `infrastructure/gcp/cloud-deployment/gkubernetes-engine-ols` workspace: `default`

### 1. dir: `infrastructure/gcp/cloud-deployment/gcompute-engine-bastion` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.gcloud_dns_ols: Reading...
data.terraform_remote_state.vpc_ols_network: Reading...
data.terraform_remote_state.gkubernetes_engine_ols: Reading...
data.terraform_remote_state.vpc_ols_network: Read complete after 0s
data.terraform_remote_state.gkubernetes_engine_ols: Read complete after 0s
data.terraform_remote_state.gcloud_dns_ols: Read complete after 0s
data.google_project.current: Reading...
data.google_project.current: Read complete after 0s [id=projects/onlineshop-378118]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.gcompute-engine.google_compute_firewall.firewall["ssh"] will be created
+ resource "google_compute_firewall" "firewall" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "ols-dev-gce-bastion-allow-ssh"
      + network            = "https://www.googleapis.com/compute/v1/projects/onlineshop-378118/global/networks/ols-dev-vpc-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "bastion",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # module.gcompute-engine.google_compute_instance.instance will be created
+ resource "google_compute_instance" "instance" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata             = (known after apply)
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "ols-dev-gce-bastion"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "bastion",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-southeast2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-11"
              + labels = (known after apply)
              + size   = 20
              + type   = "pd-standard"
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "https://www.googleapis.com/compute/v1/projects/onlineshop-378118/regions/asia-southeast2/subnetworks/ols-dev-vpc-subnet-asia-southeast2"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.gcompute-engine.google_dns_record_set.record[0] will be created
+ resource "google_dns_record_set" "record" {
      + id           = (known after apply)
      + managed_zone = "ols-dev-gcloud-dns-blast-ols-blast"
      + name         = "bastion.ols.blast.co.id."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # module.gcompute-engine.google_project_iam_member.sa_iam will be created
+ resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "onlineshop-378118"
      + role    = "roles/viewer"
    }

  # module.gcompute-engine.google_service_account.sa will be created
+ resource "google_service_account" "sa" {
      + account_id   = "ols-dev-gce-bastion"
      + disabled     = false
      + display_name = "Service Account for ols-dev-gce-bastion instance"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.gcompute-engine.local_file.ansible_vars[0] will be created
+ resource "local_file" "ansible_vars" {
      + content              = jsonencode(
            {
              + cluster_name = "ols-dev-gkubernetes-engine-cluster"
              + project_id   = "onlineshop-378118"
              + region       = "asia-southeast2-a"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "ansible_vars.json"
      + id                   = (known after apply)
    }

  # module.gcompute-engine.local_file.private_key will be created
+ resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0400"
      + filename             = "id_rsa.pem"
      + id                   = (known after apply)
    }

  # module.gcompute-engine.null_resource.ansible_playbook[0] will be created
+ resource "null_resource" "ansible_playbook" {
      + id       = (known after apply)
      + triggers = {
          + "playbook_checksum" = "60a355ce39c9a4274be3fc4c0373ac6e0a0f04a7e13f8ec551a970d66c285e0d"
        }
    }

  # module.gcompute-engine.tls_private_key.tls will be created
+ resource "tls_private_key" "tls" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ private_ip = (known after apply)
+ public_ip  = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/gcp/cloud-deployment/gcompute-engine-bastion`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-gce-atlantis:4141/lock?id=greyhats13%252Fol_shop%252Finfrastructure%252Fgcp%252Fcloud-deployment%252Fgcompute-engine-bastion%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/gcp/cloud-deployment/gcompute-engine-bastion`
</details>
Plan: 9 to add, 0 to change, 0 to destroy.

---
### 2. dir: `infrastructure/gcp/cloud-deployment/gkubernetes-engine-ols` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc_ols_network: Reading...
data.terraform_remote_state.vpc_ols_network: Read complete after 1s
data.google_service_account.gcompute_engine_default_service_account: Reading...
data.google_service_account.gcompute_engine_default_service_account: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.gkubernetes_engine.google_container_cluster.cluster will be created
+ resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "asia-southeast2-a"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "ols-dev-gkubernetes-engine-cluster"
      + network                     = "https://www.googleapis.com/compute/v1/projects/onlineshop-378118/global/networks/ols-dev-vpc-network"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + resource_labels             = {
          + "business_unit" = "ols"
          + "code"          = "gkubernetes-engine"
          + "environment"   = "dev"
          + "feature"       = "cluster"
        }
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "https://www.googleapis.com/compute/v1/projects/onlineshop-378118/regions/asia-southeast2/subnetworks/ols-dev-vpc-subnet-asia-southeast2"
      + tpu_ipv4_cidr_block         = (known after apply)

      + binary_authorization {
          + evaluation_mode = "PROJECT_SINGLETON_POLICY_ENFORCE"
        }

      + cluster_autoscaling {
          + enabled = false
        }

      + dns_config {
          + cluster_dns        = "CLOUD_DNS"
          + cluster_dns_domain = "blast.local"
          + cluster_dns_scope  = "VPC_SCOPE"
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods-range"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services-range"
          + stack_type                    = "IPV4"
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = true
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled = false

          + cidr_blocks {
              + cidr_block   = "182.253.194.32/28"
              + display_name = "my-home-public-ip"
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "192.168.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)
        }
    }

  # module.gkubernetes_engine.google_container_node_pool.nodepool["spot"] will be created
+ resource "google_container_node_pool" "nodepool" {
      + cluster                     = "ols-dev-gkubernetes-engine-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "asia-southeast2-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "spot"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = "BALANCED"
          + max_node_count  = 20
          + min_node_count  = 2
        }

      + node_config {
          + disk_size_gb      = 20
          + disk_type         = "pd-standard"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "business_unit" = "ols"
              + "code"          = "gkubernetes-engine"
              + "environment"   = "dev"
              + "feature"       = "cluster"
              + "name"          = "ols-dev-gkubernetes-engine-cluster-nodepool-spot"
              + "type"          = "spot"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "spot",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = false
              + enable_secure_boot          = true
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_ca_certificate     = (known after apply)
+ cluster_client_certificate = (known after apply)
+ cluster_client_key         = (sensitive value)
+ cluster_endpoint           = (known after apply)
+ cluster_id                 = (known after apply)
+ cluster_master_version     = (known after apply)
+ cluster_self_link          = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/gcp/cloud-deployment/gkubernetes-engine-ols`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-gce-atlantis:4141/lock?id=greyhats13%252Fol_shop%252Finfrastructure%252Fgcp%252Fcloud-deployment%252Fgkubernetes-engine-ols%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/gcp/cloud-deployment/gkubernetes-engine-ols`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`